InformationRegisters/ИсполнителиЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсполнителиЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаИсполнителейЗадач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИсполнителейЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/РолиИсполнителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>РолиИсполнителей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Назначение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипПользователей</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ИсполнителиЗадач/Forms/РолиИИсполнителиЗадач/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++
	//ОсновнойОбъектАдресации = Параметры.ОсновнойОбъектАдресации;
	УстановитьУсловноеОформление();
	//--
	
	ОбновитьДанныеЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_РолеваяАдресация" Тогда
		ОбновитьДанныеЭлементов();
	//++ Потолки
		ПерейтиКТекущейРоли();
		
	ИначеЕсли ИмяСобытия = "Запись_РольИсполнителя" Тогда
		ОбновитьДанныеЭлементов();
		ТекущаяРоль = Параметр;
		ПерейтиКТекущейРоли();
	//-- Потолки
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	НазначитьИсполнителей(Неопределено);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	НазначитьИсполнителей(Неопределено);
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВсеНазначенияВыполнить(Команда)
	
	ЗначениеОтбора = Новый Структура("ОсновнойОбъектАдресации", ОсновнойОбъектАдресации);
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("РегистрСведений.ИсполнителиЗадач.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВыполнить(Команда)
	ОбновитьДанныеЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура НазначитьИсполнителей(Команда)
	
	Назначение = Элементы.Список.ТекущиеДанные;
	Если Назначение = Неопределено Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Необходимо выбрать роль в списке.'"));
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.ИсполнителиЗадач.Форма.ИсполнителиРолиСОбъектомАдресации", 
		Новый Структура("ОсновнойОбъектАдресации,Роль", 
			ОсновнойОбъектАдресации, 
			Назначение.РольСсылка));
			
КонецПроцедуры

&НаКлиенте
Процедура СписокРолей(Команда)
	ОткрытьФорму("Справочник.РолиИсполнителей.ФормаСписка",,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСведенияОРоли(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	//++
	ТекущаяРоль = Элементы.Список.ТекущиеДанные.РольСсылка;
	//--
	
	ПоказатьЗначение(, Элементы.Список.ТекущиеДанные.РольСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанныеЭлементов()
	
	//++ Потолки
	ОсновнойОбъектАдресации = Неопределено;
	//-- Потолки
	
	ВыборкаЗапроса = БизнесПроцессыИЗадачиСервер.ВыбратьРолиСКоличествомИсполнителей(ОсновнойОбъектАдресации);
	СписокОбъект = РеквизитФормыВЗначение("Список");
	СписокОбъект.Очистить();
	Пока ВыборкаЗапроса.Следующий() Цикл
		//++ Потолки
		//ТипЗначения = ВыборкаЗапроса.ТипыОсновногоОбъектаАдресации.ТипЗначения;
		//ВключаетТип = Истина;
		//Если ОсновнойОбъектАдресации <> Неопределено Тогда
		//	ВключаетТип = ТипЗначения <> Неопределено И ТипЗначения.СодержитТип(ТипЗнч(ОсновнойОбъектАдресации));
		//КонецЕсли;
		//Если ВключаетТип Тогда
		Если НЕ ВыборкаЗапроса.Архивная 
			ИЛИ (ВыборкаЗапроса.Архивная И ПоказыватьАрхивныеРоли) Тогда
		//-- Потолки
			НоваяСтрока = СписокОбъект.Добавить();
			//++ Потолки
			//ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗапроса, "Исполнители,Роль,РольСсылка,ВнешняяРоль");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗапроса, "Исполнители,Роль,РольСсылка,Архивная,ПометкаУдаления"); 
	        //-- Потолки
		КонецЕсли;
	КонецЦикла;
	СписокОбъект.Сортировать("Роль");
	Для каждого СтрокаСписка Из СписокОбъект Цикл
		
		//++ Потолки
		РольАрхивная = (СтрокаСписка.Архивная ИЛИ СтрокаСписка.ПометкаУдаления);
		Если СтрокаСписка.Архивная Тогда
			СтрокаСписка.Картинка = 7;
		ИначеЕсли СтрокаСписка.ПометкаУдаления Тогда
			СтрокаСписка.Картинка = 6;
		КонецЕсли;
		//-- Потолки
		
		Если СтрокаСписка.Исполнители = 0 Тогда
			СтрокаСписка.ИсполнителиСтрока = ?(СтрокаСписка.ВнешняяРоль, НСтр("ru = 'заданы в другой базе'"), НСтр("ru = 'не заданы'"));
			Если НЕ РольАрхивная Тогда
				СтрокаСписка.Картинка = ?(СтрокаСписка.ВнешняяРоль, -1, 1);
			КонецЕсли;
		ИначеЕсли СтрокаСписка.Исполнители = 1 Тогда
			СтрокаСписка.ИсполнителиСтрока = Строка(БизнесПроцессыИЗадачиСервер.ВыбратьИсполнителя(ОсновнойОбъектАдресации, СтрокаСписка.РольСсылка));
			Если НЕ РольАрхивная Тогда
				СтрокаСписка.Картинка = -1;
			КонецЕсли;
		Иначе
			СтрокаСписка.ИсполнителиСтрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 чел'"), Строка(СтрокаСписка.Исполнители) );
			Если НЕ РольАрхивная Тогда
				СтрокаСписка.Картинка = -1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЗначениеВРеквизитФормы(СписокОбъект, "Список");
	
КонецПроцедуры

#КонецОбласти

#Область ПотолкиМодификация

&НаКлиенте
Процедура ДобавитьРоль(Команда)
	ОткрытьФорму("Справочник.РолиИсполнителей.ФормаОбъекта", Новый Структура);	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКТекущейРоли()
	
	ИдТекущейСтроки = Неопределено;
	Для Каждого СтрокаТЗ Из Список Цикл    
		Если СтрокаТЗ.РольСсылка = ТекущаяРоль  Тогда
			ИдТекущейСтроки = СтрокаТЗ.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЦикла;
	Если НЕ ИдТекущейСтроки = Неопределено Тогда
		Элементы.Список.ТекущаяСтрока = ИдТекущейСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьАрхивныеРолиПриИзменении(Элемент)
	ОбновитьДанныеЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура ПометитьРольНаУдаление(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Контекст = Новый Структура("РольСсылка, ПометкаУдаления");
	ЗаполнитьЗначенияСвойств(Контекст, ТекущиеДанные);
	
	Если Контекст.ПометкаУдаления Тогда
		ТекстВопроса = НСтр("ru = 'Снять с ""%1"" пометку на удаление?'");
	Иначе
		ТекстВопроса = НСтр("ru = 'Пометить ""%1"" на удаление?'");
	КонецЕсли;
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, ТекущиеДанные.Роль);
	
	Обработчик = Новый ОписаниеОповещения("ПометитьРольНаУдалениеПослеПодтверждения", ЭтотОбъект, Контекст);
	ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьРольНаУдалениеПослеПодтверждения(Ответ, Контекст) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПометитьРольНаУдалениеНаСервере(Контекст);
	
	ТекущаяРоль = Контекст.РольСсылка;
	ОбновитьДанныеЭлементов();
	
	ПерейтиКТекущейРоли();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПометитьРольНаУдалениеНаСервере(Контекст)
	
	РольОбъект = Контекст.РольСсылка.ПолучитьОбъект();
	РольОбъект.УстановитьПометкуУдаления(Не Контекст.ПометкаУдаления);
	РольОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Оформление архивной роли
	ОбщийМодульСервер.УстановитьУсловноеОформлениеЦветТекста(
		УсловноеОформление.Элементы, "Список", 
		Новый ПолеКомпоновкиДанных("Список.Архивная"), ВидСравненияКомпоновкиДанных.Равно, Истина,
		ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
		
	ОбщийМодульСервер.УстановитьУсловноеОформлениеЦветТекста(
		УсловноеОформление.Элементы, "Список", 
		Новый ПолеКомпоновкиДанных("Список.ПометкаУдаления"), ВидСравненияКомпоновкиДанных.Равно, Истина,
		ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
КонецПроцедуры
	
#КонецОбласти
